OpenFOAM_joukowski_airfoil_simulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       115520;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       115600;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       115800;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       115980;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          116000;
        startFace       116480;
    }
)

// ************************************************************************* //
